In [1]:
import pandas as pd

In [3]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

In [8]:
# Step 1 - Create a dictionary 
data = {'Country':['Belgium', 'India', 'Brazil'],
       'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
       'Population': [11190846, 1303171035, 207847528]}

# Step 2 -  
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [9]:
Global_PS4_Sales = pd.Series([10.0, 30.2, 35.9, 73.6, 91.6, 94.7], index=[2014, 2015, 2016, 2017, 2018, 2019])
Global_PS4_Sales

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [10]:
data = {'Character': ['Killua', 'Kurapika', 'Gon', 'Chrollo', 'Hisoka'], 
        'Nen': ['Kanmuru', 'Jail Chain', 'Jajanken', 'Bandit Secret', 'Bungee Gum'], 
        'Nen Type': ['Transmuter', 'Conjurer', 'Enhancer', 'Specialist', 'Transmuter'], 
        'Votes': [7488, 7000, 2472, 1904, 1144]}

HxH_Popularity_Poll = pd.DataFrame(data, columns=['Character', 'Nen', 'Nen Type', 'Votes']) 

HxH_Popularity_Poll

  Character            Nen    Nen Type  Votes
0    Killua        Kanmuru  Transmuter   7488
1  Kurapika     Jail Chain    Conjurer   7000
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [14]:
HxH_Popularity_Poll.to_csv('MyDataFrame.csv')

In [17]:
aqd = pd.read_csv('aqd.csv')
aqd

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5    NaN      NaN  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

In [18]:
aqd.head()

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2
2           3   12.0    149.0  12.6    74      5    3
3           4   18.0    313.0  11.5    62      5    4
4           5    NaN      NaN  14.3    56      5    5

In [19]:
aqd.tail()

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

In [20]:
s = Global_PS4_Sales 
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [21]:
df = HxH_Popularity_Poll
df

  Character            Nen    Nen Type  Votes
0    Killua        Kanmuru  Transmuter   7488
1  Kurapika     Jail Chain    Conjurer   7000
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [22]:
s[2016]

35.9

In [23]:
# iloc - m row, n column indexes 
df.iloc[[3],[2]]

     Nen Type
3  Specialist

In [24]:
df.loc[[2], ['Nen']]

        Nen
2  Jajanken

In [25]:
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [26]:
s[3:5]

2017    73.6
2018    91.6
dtype: float64

In [27]:
df

  Character            Nen    Nen Type  Votes
0    Killua        Kanmuru  Transmuter   7488
1  Kurapika     Jail Chain    Conjurer   7000
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [28]:
df[2:5]

  Character            Nen    Nen Type  Votes
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [29]:
df.loc[:, ['Nen Type']]

     Nen Type
0  Transmuter
1    Conjurer
2    Enhancer
3  Specialist
4  Transmuter

In [30]:
df.loc[[0, 3], ['Character', 'Votes']]

  Character  Votes
0    Killua   7488
3   Chrollo   1904

In [31]:
# Indexing 
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [32]:
s[s>30]

2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [33]:
df

  Character            Nen    Nen Type  Votes
0    Killua        Kanmuru  Transmuter   7488
1  Kurapika     Jail Chain    Conjurer   7000
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [34]:
df.loc[(df['Votes']>1000)&(df['Votes']<5000),]

  Character            Nen    Nen Type  Votes
2       Gon       Jajanken    Enhancer   2472
3   Chrollo  Bandit Secret  Specialist   1904
4    Hisoka     Bungee Gum  Transmuter   1144

In [35]:
df.loc[df['Nen Type']=='Transmuter']

  Character         Nen    Nen Type  Votes
0    Killua     Kanmuru  Transmuter   7488
4    Hisoka  Bungee Gum  Transmuter   1144

In [36]:
df.loc[(df['Nen']=='Kanmuru'), ['Character']]

  Character
0    Killua

In [38]:
df.loc[df['Nen Type']=='Transmuter', ['Character', 'Nen', 'Votes']]

  Character         Nen  Votes
0    Killua     Kanmuru   7488
4    Hisoka  Bungee Gum   1144